       IDENTIFICATION DIVISION.
       PROGRAM-ID. COURSES.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-COURSE.
           05 WS-COURSE-CRN PICTURE XXXXX.
           05 WS-COURSE-NAME PICTURE X(20).

       PROCEDURE DIVISION.
           DISPLAY "Hello world".
       END PROGRAM COURSES.
